# Створіть словник “stock”, який міститиме в собі
# (ключ — назва товару. Значення — кількість товару на складі).
# Написати програму, яка запитує який товар та кількість, яку
# хоче купити користувач. Вивести на екран True, якщо користувач
# може купити цей товар, якщо ні — False.

stock = {"Клавіатура": 2, "Комп'ютерна миша": 3, "Монітор": 0}

choice = input("Що ви хочете придбати?\n")
kys = []

for key in stock.keys():
    kys.append(key)


if choice in kys and stock[choice] > 0:
    print('З вас 5 грн.')
else:
    print('Вийди звідси')
