# Створіть словник, який містить (ключ — ім’я студента. Значення — список із балами). 
# Попросіть користувача ввести ім’я студента. 
# Порахувати середній бал студента, ім’я якого ввів користувач.

students = {
    'Олександр': [2, 15, 8, 0, 1],
    'Іван': [1, 5, 5, 12, 6, 8]
}

input = input("Введіть ім'я студента\n")

for key, val in students.items():
    if key == input:
        len = len(val)
        sum = 0
        
        for number in val:
            sum += number
        
        print(sum / len)
        break