# Завдання 1: Напишіть програму, яка дозволяє користувачеві ввести декілька речень (текст) і обробити цей текст. Після того, як користувач введе текст, програма має вивести на екран:
# Загальну кількість символів у тексті (включаючи пробіли).
# Кількість слів у тексті.
# Кількість речень у тексті.
# Загальну кількість унікальних слів (без урахування регістру).
# Список унікальних слів.

# Завдання 3: Напишіть програму, яка дозволяє керувати складом товарів. Користувач може додавати нові товари, видаляти товари, переглядати список наявних товарів, знаходити товар за назвою та визначати загальну вартість товарів на складі.


# Завдання 2: Напишіть програму, яка дозволяє користувачеві вводити 
# ім'я та академічні оцінки студентів у списки. 
# Після того, як користувач завершить введення даних, програма має вивести на екран:
# Список студентів разом з їхніми оцінками.
# Середню оцінку для кожного студента.
# Середню оцінку для всіх студентів.
