# Множини
# a = set() множина
# и = {} Це словник а не множина

# a.add(el) -> {..., el} якщо такий елемент є, то не додасть
# a.remove(el) -> {...} виникає помилка якщо елементу немає
# a.discard(el) -> {...} не виникая помилка якщо елементу немає 

# a = set('hello')
# b = set('hi there')

# print('a ^ b') -> XOR будуть видалені всі не спільні елементи
# print(a ^ b)

# print('a & b') -> AND всі спільні елементи будуть виведені
# print(a & b)

# print('a | b') -> OR будуть виведені всі елементи обох множин
# print(a | b)

# import random

