# 1. Додати функціонал зміни позиції працівника.

# Крок 2. Створіть програму, яка запитує у користувача список чисел. Програма повинна 
# створити словник, де ключі - унікальні значення зі списку, а значення - кількість входжень кожного значення в список.
# Нарешті, програма повинна надрукувати отриманий словник.

# Крок 3. Створіть програму, яка приймає список рядків і повертає найчастіші 10 слів у цих рядках, 
# ігноруючи звичайні займенники, прийменники та частки мови.

# Додати до завдання позицію і щоб її можна було б змінювати