# Вивести на екран три найпоширеніші символи в рядку (пробіл за символ не вважаємо).

# Напишіть програму, яка приймає два списки та повертає список, 
# який містить елементи, які зустрічаються у обох вхідних списках.

# Створіть програму, яка приймає список та повертає словник, 
# де ключі — це елементи списку, а значення — це кількість входжень цих елементів в список.

# Напишіть функцію, яка приймає два списки та повертає True, 
# якщо обидва списки містять однакові елементи, незалежно від їх порядку.