# Твоє домашнє завдання: написати програму:
# інформацію про себе: ім'я, прізвище,
# чи є домашній улюбленець (якщо є вивести питання "Як його звуть?",
# якщо немає, спитати про хобі) і вивести результат.
# Все має бути в окремих змінних.))


first_name = input('Як тебе звати? ')
last_name = input('Яке твоє прізвище? ')

is_pet_owner = input('В тебе є домашній улюбленець? (Так чи Ні) ')

if is_pet_owner == 'Так':
    
    pet_name = input('Як його звати? ')
    
    print("Ім'я: " +  first_name + "\n" + "Прізвище: " + last_name + "\n" + "Ім'я домашнього улюбленця: " + pet_name)
    
elif is_pet_owner == 'Ні':

    hobby = input('Яке в тебе хобі? ')
  
    print("Ім'я: " +  first_name + "\n" + "Прізвище: " + last_name + "\n" + "Хобі: " + hobby)
else:
   
    print('Некоректні дані')