# Напишіть функцію, яка перетворює рядок у "Шифр Цезаря". 
# Користувач вводить рядок і зсув, а функція повертає зашифрований рядок, 
# де кожна літера зсувається на позицію вправо за алфавітом.

# Створіть функцію, яка приймає два числа — основу і показник степеня. 
# Функція повинна обчислити основу, піднесену до степеня, використовуючи цикл, і повернути результат.

# Напишіть функцію для сортування списку з об'єктів за певним атрибутом об'єктів. 
# Наприклад, у вас є список об'єктів класу "Студент", і ви хочете відсортувати студентів за їхнім середнім балом.