# Створіть словник “stock”, який міститиме в собі
# (ключ — назва товару. Значення — кількість товару на складі).
# Написати програму, яка запитує який товар та кількість, яку
# хоче купити користувач. Вивести на екран True, якщо користувач
# може купити цей товар, якщо ні — False.


# Доробити за допомогою словників

# Гра "Вгадай слово". У цій грі комп'ютер загадує слово, 
# а користувач повинен відгадати його, отримуючи на кожну 
# спробу підказку від програми. Наприклад, на першій спробі 
# програма може вивести довжину слова, на другій — першу букву 
# слова, на третій — останню букву і т.д.