# Написати функцію підписки користувача, яка приймає 
# на вхід електронну пошту, прізвище, відмітку про 
# погодження отримувати:
# розсилку «Новини»,
# розсилку «Що нового»
# рекламну розсилку.
# Останні три параметри мають значення за замовчуванням True.
# Викликати цю функцію з різними наборами аргументів.
# Передбачити в програмі глобальний список розсилки і додавати 
# пошту користувача в цей список.


subs_users = []

def subscription(email, last_name, sub_news=True, sub_changes=True, advers=True):
    
    global subs_users
    subs_users.append(email)
    
    print(f'Ви ({last_name}) підписалися на всі існуючі розсилки які можна, тепер ваша пошта не буде відпочивати 😘', subs_users)
    

subscription('hryshkooleksandr790@gmail.com', 'Hryshko')