# Гра 'Хто є хто'. У цій грі користувач повинен відгадати
# тварину, яку ми загадали. Ми надаємо користувачеві опис
# цієї тварини, включаючи її колір, розмір, дії і т.д.
# Користувач повинен ввести свій варіант тварини, а
# програма повинна повідомити користувачеві, чи він
# відгадав правильно, чи ні.

import random

# Список тварин з описом
animals = {
    'лев': {
        'колір': 'жовтий',
        'розмір': 'великий',
        'дії': 'реве, полює, живе в савані',
    },
    'слон': {
        'колір': 'сірий',
        'розмір': 'дуже великий',
        'дії': 'має хобот, їсть рослини, живе в савані',
    },
    'пінгвін': {
        'колір': 'чорно-білий',
        'розмір': 'середній',
        'дії': 'плаває, живе в Антарктиді, не літає',
    },
    'лисиця': {
        'колір': 'руда',
        'розмір': 'маленький',
        'дії': 'хитра, полює на дрібну здобич, живе в лісі',
    },
    'жирафа': {
        'колір': 'жовто-коричневий',
        'розмір': 'дуже великий',
        'дії': 'має довгу шию, їсть листя, живе в савані',
    },
}

# Випадковий вибір тварини
random_animal = random.choice(['жирафа', 'лисиця', 'пінгвін', 'слон', 'лев'])


print(
f'''
Колір: {animals[random_animal]['колір']}
Розмір: {animals[random_animal]['розмір']}
Дії: {animals[random_animal]['дії']}
'''
)

choice = input('Ваш варіант: ')

if choice.lower() == random_animal.lower():
    print(f'Ви вгадали, це насправді {random_animal}.')
else:
    print(f'Ви не вгадали, правильна відповідь: {random_animal}')