# Створіть словник з переліком фруктів та їх калорійністю. 
# Виведіть на екран калорійність вашого улюбленого фрукту.

# Створіть словник з іменами та віком декількох людей. 
# Виведіть на екран найстаршу людину.

# Напишіть програму, яка об'єднує два словники в один. 
# Ключі та значення в обох словниках повинні бути різними.

# Напишіть програму, яка дозволяє користувачам реєструватися 
# на сайті та зберігає їх дані у словнику. Ключ — ім'я користувача, 
# а значення — пароль.

# Гра "Хто є хто". У цій грі користувач повинен відгадати 
# тварину, яку ми загадали. Ми надаємо користувачеві опис 
# цієї тварини, включаючи її колір, розмір, дії і т.д. 
# Користувач повинен ввести свій варіант тварини, а 
# програма повинна повідомити користувачеві, чи він 
# відгадав правильно, чи ні.

# Гра "Вгадай слово". У цій грі комп'ютер загадує слово, 
# а користувач повинен відгадати його, отримуючи на кожну 
# спробу підказку від програми. Наприклад, на першій спробі 
# програма може вивести довжину слова, на другій — першу букву 
# слова, на третій — останню букву і т.д.