# Практичне завдання
# Уявімо, що ми розробляємо інформаційну систему продуктового магазину, яка має виконувати наступні функції:
# Показ усіх наявних товарів (виведення елементів списку);
# Постачання нових товарів (додавання елементів, об’єднання списків);
# Продаж товарів (пошук елемента списку і видалення його);
# Заміна проданих продуктів на нові (вставка елемента);
# Виведення списку проданих продуктів за день;
# Показати історію продажів (виведення списку в зворотному порядку).




# Cписок продуктів
products = [
    "Хліб",
    "Молоко",
    "Яйця",
    "Макарони",
    "Яблука",
    "Цукор",
    "Куряче філе",
    "Картопля",
    "Олія",
    "Морква",
]


# Список проданих продуктів
selled_products = []

# Функція яка виводе всі продукти які є на даний момент
def print_products():
    
    # Якщо продукти не порожні
    if products:
        i = 1
        # Виводимо їх циклом
        for item in products:
            print(f"{i}: {item}")
            i += 1
            
    # Якщо порожні виводимо що продуктів немає
    else:
        print("Продукти не знайдено")


# Функція яка додає продукти по введеному інпуту
def add_new_product():
    
    # Створюю список в який лягають дані з інпуту
    list_of_new_products = input('Введіть список продуктів які хочете додати (через пробіл): ').split()
    
    # Додаю до списку продуктів елементи створеного списку
    products.extend(list_of_new_products)


    # Та вивід теперешніх продуктів які є
    print('Новий список:')
    print_products()


# Функція продажу товару
def sell_product():
    
    # Спочатку виводимо всі товари які є
    print_products()
    
    # Потім створюю змінну яка приймає значення з інпуту
    product = input("Введіть назву товару: ")
    
    
    # Якщо товар є в списку продуктів
    if product in products:
        
        
        # створюю змінну яка дорівнює індексу товару
        product_id = products.index(product)
        
        # видаляю та зхберігаю товар в змінній
        selled_product = products.pop(product_id)
        
        # розширюю масив проданих товарів проданим товаром
        selled_products.append(selled_product)

        # Вивожу що товар продано
        print(f'{product} продано.')
    
    # Якщо товару нема, вивожу що його нема :О
    else:
        print("Нема в наявності")


# Функція виводу всіх проданих товарів
def print_selled():
    
    # Якщо список проданих товарів не порожній
    if selled_products:
        
        # циклом виводжу всі елементи
        i = 1
        for item in selled_products:
            print(f'{i}. {item} ')
    
    # якщо порожній, воводжу що нічого не продано
    else:
        print("За сьогодні нічого не продано")


# Функція виводу історіі продажу
def print_selled_history():
    
    # Знов таки якщо список проданих товарів не порожній
    if selled_products:
        
        # Створю копію списку проданих товарів
        reversed_selled_products = selled_products.copy()
        
        # Перевертаю його
        reversed_selled_products.reverse()
        
        # циклом виводжу кожний елемент
        i = 1
        for item in reversed_selled_products:
            print(f"{i}: {item}")
            i += 1
    
    # :D
    else:
        print("За сьогодні нічого не продано")


# Головна функція 
def main():
    
    # Зі стартом програми виводжу вітання
    print("Вітаю, це інформаційна система продуктового магазину")
    
    # Завжди коли ТРу виконуються команди
    while True:

        # Виводимо список команд
        print("Список команд:\n1. Показати всі товари\n2. Додати товар\n3. Продати товар\n4. Показати продані товари\n5. Показати історію продажу товаарів\n6. Вийти з інформаційної системи")
        
        # Потім інпутом приймаємо значення від 1 до 6
        command = int(input("Введіть команду (1, 2, 3...): "))
        
        # Перевірка на правильність команди
        if command in range(1, 7):
            
            # Якщо 1 то виводимо всі продукти
            if command == 1:
                print_products()
                input('Натисніть ентер щоб продовжити... ')
                
            # Якщо 2 виконуємо функцію додавання елементів
            elif command == 2:
                add_new_product()
                input('Натисніть ентер щоб продовжити... ')

            # Якщо 3 продаємо
            elif command == 3:
                sell_product()
                input('Натисніть ентер щоб продовжити... ')
                
            # Якщо 4 виводимо продане
            elif command == 4:
                print_selled()
                input('Натисніть ентер щоб продовжити... ')

            
            # Якщо 5 виводимо історіію продажу
            elif command == 5:
                print_selled_history()
                input('Натисніть ентер щоб продовжити... ')

            # Якщо 6 зупиняємо програму
            else:
                return False
            
        # Якщо некоректні дані :DDD
        else:
            print('Введено некорректні дані')
            input('Натисніть ентер щоб продовжити... ')
            

# Визиваємо головну функцію
main()
