# Створити клас Холодильник. Створити атрибути: кількість
# поличок, наявні продукти, скільки років холодильнику.

# Створити функцію, яка буде визначати за допомогою рандому
# чи зламався холодильник. Створити функцію, яка виводитиме
# усі продукти у холодильнику. (Додатково: Створити функцію, 
# яка буде виводити страви, які можна приготувати з наявних
# продуктів у холодильнику (наприклад: ковбаса та хліб = бутерброд))

# створити клас калькулятор. додати функціію для підрахування суми різниці ділення та множення.