# (зрізи:)
# Вивести рядок через одну літеру. (рядок не менше 55 символів) 
# вивести символи з 19 по 26 (не включно)
# вивести усі символи до 19 символу не включно

str = 'Метелики вражають красою своїх крил і граційним польотом. Вони символізують трансформацію.'

print()

print('Вивести рядок через одну літеру. (рядок не менше 55 символів)')
print(str[::2])

print()

print('вивести символи з 19 по 26 (не включно)')
print(str[19:26:].upper())

print()

print('вивести усі символи до 19 символу не включно')
print(str[:19:])