# Завдання 1: Напишіть програму, яка зчитує дані з текстового файлу, який містить список студентів і їх оцінок. 
# Кожен рядок у файлі представляє окремого студента та його оцінки, розділені комою.
# Після зчитування файлу, програма повинна обчислити середній бал кожного студента і записати результат у новий файл з ім'ям "результати.txt".

# Текстовий файл:
# John,85,90,78
# Alice,95,87,92
# Michael,80,88,75


# Завдання 2: Напишіть програму, яка зчитує дані з текстового файлу, який містить імена та вік студентів.
# Кожен рядок у файлі містить ім'я студента та його вік, розділені комою.
# Після зчитування файлу, програма повинна знайти найстаршого та наймолодшого студентів і вивести їх імена на екран.

# Текстовий файл:
# John,20
# Alice,22
# Michael,18