# Користувач вводить рядок тексту та символ для пошуку. 
# Напишіть програму, яка підраховує кількість входжень цього символу у рядку.

str = input('Введіть рядок:\n')
to_find = input('Введіть символ для пошуку:\n')

while len(to_find) > 1:
    print('Ви ввели більше ніж 1 символ')
    to_find = input('Введіть символ для пошуку:\n')
    
result = 0
for item in str:
    if item.lower() == to_find.lower():
        result += 1 
        
print(f"Кількість входження символу '{to_find}' в тексті дорівнює: {result} ")