# Створіть програму, яка приймає від користувача дві строки та знаходить найкоротший загальний підрядок у цих строках. Виведіть цю підрядок.

# Створіть програму, яка приймає від користувача дві строки та порівнює їх лексикографічно (за алфавітом). Виведіть результат порівняння у вигляді логічного значення (True або False).

# Створіть програму, яка приймає від користувача строку та знаходить кількість голосних літер у цьому рядку Виведіть цю кількість.

# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом (слово, яке читається однаково зліва направо та справа наліво). Виведіть результат у вигляді логічного значення (True або False). (Пилип, радар)

# Створіть програму, яка приймає від користувача строку та перетворює її у список, де кожен елемент — це слово зі строки. Виведіть цей список.

# Користувач вводить рядок тексту та символ для пошуку. Напишіть програму, яка підраховує кількість входжень цього символу у рядку.
# Користувач вводить рядок тексту, програма перетворює всі голосні літери у рядку на символ 'X'