# 3. Задайте словник, де ключі - це назви країн, а значення — столиці цих країн.
# Попросіть користувача ввести назву країни, і виведіть столицю цієї країни.

countrys = {
    "Україна": "Київ",
    "Сполучені штати": "Вашингтон",
    "Франція": "Париж",
    "Єгипет": "Каїр",
    "Марокко": "Рабат",
    "Італія": "Рим",
    "Греція": "Афіни",
    "Бангладеш": "Дакка",
    "Бразилія": "Бразиліа",
    "Пуерто-Ріко": "Сан-Хуан",
    "Іспанія": "Мадрид",
    "Португалія": "Лісабон",
    "Австралія": "Канберра",
    "Японія": "Токіо",
    "Польщя": "Варшава",
    "Німеччина": "Берлін",
    "Молдова": "Кишинів",
    "Словенія": "Любляна",
}

counter = 1

for key in countrys.keys():
    print(f'{counter}. {key}')
    counter += 1
    
    
country = input('Впишіть назву країни щоб дізнатись її столицю\n')
    
while country not in countrys.keys():
    print("Ви ввели некорректні дані")
    
    country = input('Впишіть назву країни щоб дізнатись її столицю\n')
    
    
print(f'Столиця {country} - {countrys[country]}')